app/controllers/login_controller.rb

  def create
    staff = Staff.find_by(user_name: params[:login][:user_name])
---
SELECT  "staffs".* FROM "staffs"  WHERE "staffs"."user_name" IS NULL LIMIT 1