app/controllers/m_login_controller.rb

SELECT  "lib_managers".* FROM "lib_managers"  WHERE "lib_managers"."name" = 'BBB' LIMIT 1
---
  def create
    @manager = LibManager.find_by(name:params[:m_login][:name])