app/controllers/program_controller.rb

SELECT "readers".* FROM "readers"
---
	def report
	    @readers = Reader.all