app/controllers/readers_controller.rb

SELECT "readers".* FROM "readers" WHERE (reader.first_name like '%3%' OR reader.last_name like '%3%' OR reader.id like '%3%')  ORDER BY created_at DESC
---
	def index
		@readers = Reader.all

SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@reader = Reader.find(params[:id])

INSERT INTO "readers" ("created_at", "first_name", "last_name", "program", "reg_location", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-11-15 20:23:41.356287"], ["first_name", "Gege"], ["last_name", "Li"], ["program", "CS"], ["reg_location", "texas"], ["updated_at", "2014-11-15 20:23:41.356287"]]
---
	def create
		@reader = Reader.new(reader_params)
		if @reader.save

SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@reader = Reader.find(params[:id])

SELECT  "readers".* FROM "readers" WHERE "readers"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "readers" SET "end_initial" = ?, "halfway_check" = ?, "mid_date" = ?, "mid_initial" = ?, "updated_at" = ? WHERE "readers"."id" = 1  [["end_initial", ""], ["halfway_check", "t"], ["mid_date", "2014-12-12"], ["mid_initial", ""], ["updated_at", "2014-12-10 17:44:11.184946"]]
---
	def update
		@reader = Reader.find(params[:id])
		if @reader.update_attributes(reader_params)

SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "readers" WHERE "readers"."id" = ?  [["id", 1]]
---
	def destroy
		@reader = Reader.find(params[:id])
		@reader.destroy