app/controllers/staffs_controller.rb

SELECT "staffs".* FROM "staffs"
---
    def index
        @staffs = Staff.all

INSERT INTO "staffs" ("created_at", "first_name", "last_name", "location", "password_digest", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @staff = Staff.new(staff_params)
        if @staff.save

SELECT  "staffs".* FROM "staffs"  WHERE "staffs"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @staff = Staff.find(params[:id])